print(300, "강태욱입니다")
print("300"+" "+"강태욱입니다")
a= 300
name="홍길동"
print(a, name)
a= "김길동"
print(a)
a="김길동"
b='박길동'
c="""
구름에 달 가듯이
가는 나그네 
"""
a='"반갑습니다"라고 말하였습니다.'
a="'반갑습니다'라고 말하였습니다."
a="\"반갑습니다\"라고 말하였습니다."
print(a)
print("안녕~\n하세요")
print("안녕~\t하세요")
print("안녕하세요\\")
print("안녕하세요"[0])
print("안녕하세요"[1])
a="안녕하세요"
print(a[0]) #안
print(a[1]) #녕
print(a[2]) #하
print(a[3]) #세
print(a[4]) #요
print(a[0]+ " "+ a[1]+ " "+  a[2]+ " "+  a[3]+ " "+  a[4]) #출력형식--> 안 녕 하 세 요
print(a[-5]) #안
print(a[-4]) #녕
print(a[-3]) #하
print(a[-2]) #세
print(a[-1]) #요
print(a[-5], a[-4], a[-3], a[-2], a[-1] )